/*-----------------------------------------------------------------------------
 * AtEthercat.h
 * Copyright                acontis technologies GmbH, Weingarten, Germany
 * Response                 Stefan Zintgraf
 * Description              interface to the ethercat master
 *---------------------------------------------------------------------------*/

#ifndef INC_ATETHERCAT
#define INC_ATETHERCAT 1

/*-INCLUDE-------------------------------------------------------------------*/
#include "EcType.h"
#include "EcError.h"
#include "EcInterfaceCommon.h"
#include "EcOs.h"
#include "EcVersion.h"
#include "EcLink.h"
#include "EthernetServices.h"


/*-PACK SETTINGS-------------------------------------------------------------*/
#if defined  __GNUC__   /* GNU */

#define EC_PACKED __attribute__((aligned(4), packed))

#if (defined __RCX__)
#pragma pack (4)
#endif

#elif defined _DIAB_TOOL

#define EC_PACKED __attribute__((aligned(4), packed))

#elif defined _MSC_VER  /* MICROSOFT */

#define EC_PACKED

#pragma pack (push, 4)
#pragma warning(disable:4514)
#elif defined __MET__

#define EC_PACKED
/*#pragma pack (push, 4)*/
#pragma Push_align_members(4)

#elif defined __ghs

#define EC_PACKED __attribute__((aligned(4), packed))
#pragma pack (4)

#elif defined(__BORLANDC__)

#pragma pack (push, 4)
#define EC_PACKED	
	
#else
#error Please check pack settings for this compiler!!!
#endif



#define EC_IOCTL_SB_ENABLE                          (EC_IOCTL_SB | 7)
#define EC_IOCTL_SB_BUSCNF_GETSLAVE_INFO_EX         (EC_IOCTL_SB | 9)
#define EC_IOCTL_SLV_ALIAS_ENABLE                   (EC_IOCTL_SB |10)
#define EC_IOCTL_SB_SET_BUSCNF_READ_PROP            (EC_IOCTL_SB |12)
#define EC_IOCTL_SB_SET_TOPOLOGY_CHANGED_DELAY      (EC_IOCTL_SB |13)
#define EC_IOCTL_SB_SET_ERROR_ON_CROSSED_LINES      (EC_IOCTL_SB |14)
#define EC_IOCTL_SB_SET_TOPOLOGY_CHANGE_AUTO_MODE   (EC_IOCTL_SB |15)
#define EC_IOCTL_SB_ACCEPT_TOPOLOGY_CHANGE          (EC_IOCTL_SB |16)

    /* Hot Connect (HC) */
#define EC_IOCTL_HC_SETMODE                         (EC_IOCTL_HC | 1)
#define EC_IOCTL_HC_GETMODE                         (EC_IOCTL_HC | 2)
#define EC_IOCTL_HC_CONFIGURETIMEOUTS               (EC_IOCTL_HC | 3)


    /* private (PRIVATE) */
#define EC_IOCTL_SET_FRAME_LOSS_SIMULATION          (EC_IOCTL_PRIVATE | 1)
#define EC_IOCTL_SET_RXFRAME_LOSS_SIMULATION        (EC_IOCTL_PRIVATE | 2)
#define EC_IOCTL_SET_TXFRAME_LOSS_SIMULATION        (EC_IOCTL_PRIVATE | 3)
#define EC_IOCTL_SET_SOFT_ASSERTIONS                (EC_IOCTL_PRIVATE | 4)
#define EC_IOCTL_SET_HARD_ASSERTIONS                (EC_IOCTL_PRIVATE | 5)

/* EtherCat CoE entry description value information bit definitions */
#define EC_COE_ENTRY_ObjAccess              0x01
#define EC_COE_ENTRY_ObjCategory            0x02
#define EC_COE_ENTRY_PdoMapping             0x04
#define EC_COE_ENTRY_UnitType               0x08
#define EC_COE_ENTRY_DefaultValue           0x10
#define EC_COE_ENTRY_MinValue               0x20
#define EC_COE_ENTRY_MaxValue               0x40

/* EtherCat CoE entry access bit definitions */
#define EC_COE_ENTRY_Access_R_PREOP         0x01
#define EC_COE_ENTRY_Access_R_SAFEOP        0x02
#define EC_COE_ENTRY_Access_R_OP            0x04
#define EC_COE_ENTRY_Access_W_PREOP         0x08
#define EC_COE_ENTRY_Access_W_SAFEOP        0x10
#define EC_COE_ENTRY_Access_W_OP            0x20

#define INVALID_SLAVE_ID                    ((EC_T_DWORD)0xFFFFFFFF)
#define INVALID_FIXED_ADDR                  ((EC_T_WORD)0x0)
#define INVALID_AUTO_INC_ADDR               ((EC_T_WORD)0x1)


#define MAX_PROCESS_VAR_NAME_LEN            ((EC_T_DWORD)72)  /* STD: Maximum length of a process variable name */
#define MAX_PROCESS_VAR_NAME_LEN_EX         ((EC_T_DWORD)128) /* EX:  Maximum length of a process variable name */
                     
#define INSTANCE_MASTER_DEFAULT             0                /* first (default) master instance used by ecatXXXXX */
#define MAX_NUMOF_MASTER_INSTANCES          10               /* maximum number of master instances */


/*-TYPEDEFS/ENUMS------------------------------------------------------------*/

struct _EC_T_NOTIFYPARMS;

/* EtherCat callback function pointer */
typedef EC_T_DWORD (*EC_PF_NOTIFY)(                 EC_T_DWORD dwCode, 
                                                    struct _EC_T_NOTIFYPARMS* pParms    );

/* EtherCAT ioctl parameters */                     
typedef struct _EC_T_IOCTLOPARMS                    
{                                                   
    EC_T_BYTE*      pbyInBuf;                       /*< in  input data buffer */
    EC_T_DWORD      dwInBufSize;                    /*< in  size of input data buffer in byte */
    EC_T_BYTE*      pbyOutBuf;                      /*< out output data buffer */
    EC_T_DWORD      dwOutBufSize;                   /*< in  size of output data buffer in byte */
    EC_T_DWORD*     pdwNumOutData;                  /*< out number of output data bytes stored in output data buffer */
}EC_PACKED EC_T_IOCTLPARMS;                                  
                                                    
/* Client register parameters */                    
typedef struct _EC_T_REGISTERPARMS                  
{                                                   
    EC_T_VOID*      pCallerData;                    /*< in  used by all callback functions */
    EC_PF_NOTIFY    pfnNotify;                      /*< in  notify callback function pointer */
}/*EC_PACKED */EC_T_REGISTERPARMS; /* Packed function pointer causes error with VxWorks DIAB compiler */
                                                    
/* Client register result */                        
typedef struct _EC_T_REGISTERRESULTS                
{                                                   
    EC_T_DWORD      dwClntId;                       /*< out client ID */
    EC_T_BYTE*      pbyPDIn;                        /*< out incoming process data shared memory */
    EC_T_DWORD      dwPDInSize;                     /*< out size of the incoming process data area */
    EC_T_BYTE*      pbyPDOut;                       /*< out outgoing process data shared memory */
    EC_T_DWORD      dwPDOutSize;                    /*< out size of the outgoing process data area */
}EC_PACKED EC_T_REGISTERRESULTS;

/* Master initialization parameters */
typedef struct _EC_T_INITMASTERPARMS
{
    EC_T_DWORD          dwValPattern;                   /*< in  Validation pattern */
    EC_T_DWORD          dwVersion;                      /*< in  Version information */
    EC_T_VOID*          pvConfigParms;                  /*< in  obsolete */
    EC_T_VOID*          pvLinkParms;                    /*< in  Link Layer parameter */
    EC_T_OS_INIT_DESC*  pOsParms;                       /*< in  OS Layer parameter */
    EC_T_DWORD          dwReserved2;                    /*< in  reserved */
    EC_T_BOOL           bUseRedundancy;                 /*< in  Use redundancy device */
    EC_T_VOID*          pvLinkParmsRed;                 /*< in  Link Layer parameter for red device */
    EC_T_DWORD          dwVlanConfig;                   /*< in  VLAN support configuration 
                                                         *      Errr.rrrr|rrrr.rrrr|rPPP.IIII|IIII.IIII 
                                                         *      E=enable (1/0), P=Prio (3Bit), I=VLAN Id (12Bit) */
    
    EC_T_WORD           wMaxBusSlaves;                  /*< in  the maximum number of pre-allocated bus slave objects */
    EC_T_WORD           wReserved;                      /*< in  reserved */
    EC_T_MASTER_CONFIG* pMasterConfig;                  /*< in  pointer to static master configuration */
    EC_T_MASTER_CONFIG  MasterConfig;                   /*< in  static master configuration */
}EC_PACKED EC_T_INITMASTERPARMS;

/* link layer debug message */                    
typedef struct _EC_T_LINKLAYER_DBG_MSG_DESC
{                                                   
    EC_T_BYTE       byEthTypeByte0;                 /*< in  Ethernet type byte 0 */
    EC_T_BYTE       byEthTypeByte1;                 /*< in  Ethernet type byte 0 */
    EC_T_WORD       wRes;
    EC_T_CHAR*      szMsg;                          /*< in  message to send to link layer */
}EC_PACKED EC_T_LINKLAYER_DBG_MSG_DESC;

#if (defined INCLUDE_DC_SUPPORT)
/* Distributed clocks */
typedef struct _EC_T_DC_SYSTIME_ADD_OFFSET_DESC
{
    EC_T_DWORD      IsNegative;                     /*< in  System time offset is Negative value */
    EC_T_DWORD      dwOffset;                       /*< in  absolute system time offset (nsec) to add */
    EC_T_DWORD      dwTimeout;                      /*< in  timeout for proceeding add offset */
}EC_PACKED EC_T_DC_SYSTIME_ADD_OFFSET_DESC;

typedef struct _EC_T_DC_SYNCSO_CB_PARM
{
    EC_T_VOID*              pvContext;          /* in       Calling environment context */
    EC_T_DWORD              dwTimeStamp;        /* in       Pre-Send Timestamp */
    EC_T_DWORD              dwPostTimeStamp;    /* in       Post-Send Timestamp */
    EC_T_DWORD              dwBusTimeLo;        /* in       Bus Time Lower 32 Bit */
    EC_T_DWORD              dwBusTimeHi;        /* in       Bus Time Upper 32 Bit */
    EC_T_DWORD              dwTimeStampResult;  /* in       Result of stamp */

    EC_T_DWORD	            dwSyncPeriodLength; /* in       Time between two consecutive SYNC0 signals of clock master slave in nsec. */

    EC_T_DWORD              dwStartSyncTimeLo;  /* out      Sync Start Time Lower 32 Bit */
    EC_T_DWORD              dwStartSyncTimeHi;  /* out      Sync Start Time Upper 32 Bit */

}EC_PACKED  EC_T_DC_SYNCSO_CB_PARM, *EC_PT_DC_SYNCSO_CB_PARM;

typedef EC_T_DWORD (*EC_T_PFSYNCSO_CB)(EC_T_DC_SYNCSO_CB_PARM* pParm);
       
typedef struct _EC_T_DC_SYNCSO_REGDESC
{
    EC_T_DC_SYNCSO_CB_PARM*     pCallbackParm;      /*< in  Callback Parameter */
    EC_T_PFSYNCSO_CB            pfnCallback;        /*< in  Callback Function */
}EC_PACKED  EC_T_DC_SYNCSO_REGDESC, *EC_PT_DC_SYNCSO_REGDESC;
 
typedef struct _EC_T_DC_CONFIGURE
{
    EC_T_DWORD                  dwClntId;           /*< in  Reserved */
    EC_T_DWORD                  dwTimeout;          /*< in  DC Timeout value in msec */
    EC_T_DWORD                  dwDevLimit;         /*< in  deviation limit value*/
    EC_T_DWORD                  dwSettleTime;       /*< in  config values for settle time*/
    EC_T_DWORD                  dwTotalBurstLength;
    EC_T_DWORD                  dwBurstBulk;
    EC_T_DWORD                  dwReserved[5];      /*< in/out 5 DWORD reserved*/
}EC_PACKED  EC_T_DC_CONFIGURE, *EC_PT_DC_CONFIGURE;

typedef struct _EC_T_DCM_BUSSHIFT_CONFIG
{
    EC_T_INT                    nCtlSetVal;         /*< in  controller set val in nsec */
    EC_T_INT                    nCtlGain;           /*< in  controller gain */
    EC_T_INT                    nCtlDriftErrorGain; /*< in  controller drift error gain */
    EC_T_INT                    nMaxValidVal;       /*< in  max valid input value */
    EC_T_BOOL                   bLogEnabled;        /*< in  EC_TRUE if logging information should be generated */
    EC_T_DWORD                  dwInSyncLimit;      /*< in  limit in nsec for InSync monitoring */
    EC_T_DWORD                  dwInSyncSettleTime; /*< in  settle time in msec for InSync monitoring */
    EC_T_DWORD                  dwReserved[2];      /*< in/out 4 DWORD reserved*/
}EC_PACKED  EC_T_DCM_BUSSHIFT_CONFIG, *EC_PT_DCM_BUSSHIFT_CONFIG;

typedef struct _EC_T_DCM_MASTERSHIFT_CONFIG
{
    EC_T_DWORD                  dwReserved[4];      /*< in/out 4 DWORD reserved*/
}EC_PACKED  EC_T_DCM_MASTERSHIFT_CONFIG, *EC_PT_DCM_MASTERSHIFT_CONFIG;
#endif /* INCLUDE_DC_SUPPORT */

/* ecatGetSlaveInfo */
typedef struct _EC_T_GET_SLAVE_INFO
{
    EC_T_DWORD                  dwScanBusStatus;    /* 0x00 */  /*< Status during last Bus Scan */
    
    EC_T_DWORD                  dwVendorId;         /* 0x01 */  /*< Vendor Identification */
    EC_T_DWORD                  dwProductCode;      /* 0x02 */  /*< Product Code */
    EC_T_DWORD                  dwRevisionNumber;   /* 0x03 */  /*< Revision Number */
    EC_T_DWORD                  dwSerialNumber;     /* 0x04 */  /*< Serial Number */
    
    EC_T_WORD                   wPortState;         /* 0x05 */  /*< out port link state (SB Instance)*/
    EC_T_WORD                   wReserved;                      /*< Res */

    EC_T_BOOL                   bDcSupport;         /* 0x06 */  /*< out slave does support DC*/
    EC_T_BOOL                   bDc64Support;       /* 0x07 */  /*< out slave does support 64Bit DC*/
    
    EC_T_WORD                   wAliasAddress;      /* 0x08 */  /*< out slave alias address*/
    EC_T_WORD                   wPhysAddress;                   /*< out slave station address*/
    
    EC_T_DWORD                  dwPdOffsIn;         /* 0x09 */  /*< out process data offset of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeIn;         /* 0x0A */  /*< out process data size of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdOffsOut;        /* 0x0B */  /*< out process data offset of Output Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeOut;        /* 0x0C */  /*< out process data size of Output Data*/
    EC_T_DWORD                  dwPdOffsIn2;        /* 0x0D */  /*< out process data offset of Input data (in Bits)*/
    EC_T_DWORD                  dwPdSizeIn2;        /* 0x0E */  /*< out process data size of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdOffsOut2;       /* 0x0F */  /*< out process data offset of Output Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeOut2;       /* 0x10 */  /*< out process data size of Output Data*/
    EC_T_DWORD                  dwPdOffsIn3;        /* 0x11 */  /*< out process data offset of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeIn3;        /* 0x12 */  /*< out process data size of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdOffsOut3;       /* 0x13 */  /*< out process data offset of Output Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeOut3;       /* 0x14 */  /*< out process data size of Output Data*/
    EC_T_DWORD                  dwPdOffsIn4;        /* 0x15 */  /*< out process data offset of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeIn4;        /* 0x16 */  /*< out process data size of Input Data (in Bits)*/
    EC_T_DWORD                  dwPdOffsOut4;       /* 0x17 */  /*< out process data offset of Output Data (in Bits)*/
    EC_T_DWORD                  dwPdSizeOut4;       /* 0x18 */  /*< out process data size of Output Data*/
    
    EC_T_WORD                   wCfgPhyAddress;     /* 0x19 */  /*< out slave configured station address*/
    EC_T_WORD                   wReserved2;                     /*< reserved */
    
    EC_T_CHAR                   abyDeviceName[ECAT_DEVICE_NAMESIZE];    
                                                    /* 0x1A */  /*< out slave name of configuration*/
    EC_T_BOOL                   bIsMailboxSlave;    /* 0x2E */  /*< out whether slave support mailboxes*/
    EC_T_DWORD                  dwMbxOutSize;       /* 0x2F */  /*< out mailbox 1 output size*/
    EC_T_DWORD                  dwMbxInSize;        /* 0x30 */  /*< out mailbox 1 input size*/
    EC_T_DWORD                  dwMbxOutSize2;      /* 0x31 */  /*< out mailbox 2 output size*/
    EC_T_DWORD                  dwMbxInSize2;       /* 0x32 */  /*< out mailbox 2 input size*/

    EC_T_DWORD                  dwErrorCode;        /* 0x33 */  /*< out last return code*/
    EC_T_DWORD                  dwSBErrorCode;      /* 0x34 */  /*< out last return value from SB*/

    EC_T_BYTE                   byPortDescriptor;   /* 0x35 */  /*< out Port Descriptor (ESC register 0x0007) */
    EC_T_BYTE                   byESCType;                      /*< out ESC Node Type */
    EC_T_WORD                   wSupportedMbxProtocols;         /*< out supported mailbox protocols: AoE, EoE, CoE, FoE, SoE */
    
    EC_T_WORD                   wAlStatusValue;     /* 0x36 */  /*< out AL Status Register Value */
    EC_T_WORD                   wAlStatusCode;                  /*< out AL Status Code */

    EC_T_BOOL                   bIsOptional;        /* 0x37 */  /*< out slave is in an optional hot connect group */
    EC_T_BOOL                   bIsPresent;         /* 0x38 */  /*< out slave is currently present on bus */

    EC_T_WORD                   wNumProcessVarsInp; /* 0x39 */  /*< out number of output process data variables*/
    EC_T_WORD                   wNumProcessVarsOutp;            /*< out number of input process data variables */

    EC_T_DWORD                  dwSlaveId;          /* 0x3A */  /*< out slave ID */
    EC_T_BOOL                   bIsHCGroupPresent;  /* 0x3B */  /*< out the hot connect group of the slave is present */

    EC_T_DWORD                  aPortSlaveIds[ESC_PORT_COUNT];  /* 0x3C */  /*< out slave IDs connected to ports */

    EC_T_DWORD                  dwSystemTimeDifference;         /* 0x40   < out System time difference (ESC register 0x092C) */

    EC_T_DWORD                  adwReserved[18];    /* 0x41 */  /*< out Reserved*/

} EC_PACKED  EC_T_GET_SLAVE_INFO, *EC_PT_GET_SLAVE_INFO;
                                                    /* Size = 0x53 * DWORD */

/* emGetSlaveInpVarInfo / emGetSlaveOutpVarInfo*/
typedef struct _EC_T_PROCESS_VAR_INFO
{
    EC_T_CHAR                   szName[MAX_PROCESS_VAR_NAME_LEN];   /**< [out] Name of the found process variable */
    EC_T_WORD                   wDataType;                          /**< [out] Data type of the found process variable */
    EC_T_WORD                   wFixedAddr;                         /**< [out] Station address of the slave that is owner of this variable */
    EC_T_INT                    nBitSize;                           /**< [out] Size in bit of the found process variable */
    EC_T_INT                    nBitOffs;                           /**< [out] Bit offset in the process data image */
